In [50]:
import pandas as pd
import numpy as np
pd.set_option('max_colwidth', None)

# Question 4 -
```
Write a program to download the data from the link given below and then read the data and convert the into
the proper structure and return it as a CSV file.
Link - https://data.nasa.gov/resource/y77d-th95.json
Note - Write code comments wherever needed for code understanding.
Excepted Output Data Attributes
● Name of Earth Meteorite - string id - ID of Earth
● Meteorite - int nametype - string recclass - string
● mass - Mass of Earth Meteorite - float year - Year at which Earth
● Meteorite was hit - datetime format reclat - float recclong - float
● point coordinates - list of int
```

In [51]:
# ● Name of Earth Meteorite - string 
# ● id - ID of Earth Meteorite - int 
# ● nametype - string 
# ● recclass - string
# ● mass - Mass of Earth Meteorite - float 
# ● year - Year at which Earth Meteorite was hit - datetime format 
# ● reclat - float 
# ● recclong - float
# ● point coordinates - list of int

In [52]:
import requests

# request the url to get json data
response = requests.get("https://data.nasa.gov/resource/y77d-th95.json")

In [53]:
# parse the json 
data = response.json()

In [54]:
# convert dict to dataframe which helps to do feature transformation easier
df = pd.DataFrame(data)

In [55]:
df.head(2)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,geolocation,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4
0,Aachen,1,Valid,L5,21,Fell,1880-01-01T00:00:00.000,50.775000,6.083330,"{'type': 'Point', 'coordinates': [6.08333, 50.775]}",NaN,NaN
1,Aarhus,2,Valid,H6,720,Fell,1951-01-01T00:00:00.000,56.183330,10.233330,"{'type': 'Point', 'coordinates': [10.23333, 56.18333]}",NaN,NaN

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   name                         1000 non-null   object
 1   id                           1000 non-null   object
 2   nametype                     1000 non-null   object
 3   recclass                     1000 non-null   object
 4   mass                         972 non-null    object
 5   fall                         1000 non-null   object
 6   year                         999 non-null    object
 7   reclat                       988 non-null    object
 8   reclong                      988 non-null    object
 9   geolocation                  988 non-null    object
 10  :@computed_region_cbhk_fwbd  133 non-null    object
 11  :@computed_region_nnqa_25f4  134 non-null    object
dtypes: object(12)
memory usage: 93.9+ KB

In [57]:
# convert object to int

df["id"] = df["id"].astype("int")

In [58]:
# convert object to float

df["mass"] = df["mass"].astype("float")

In [59]:
# convert object to float

df["reclat"] = df["reclat"].astype("float")

In [60]:
# convert object to float

df["reclong"] = df["reclong"].astype("float")

In [61]:
df["geolocation"].value_counts() # to check the values

{'type': 'Point', 'coordinates': [12.43333, 7.05]}        2
{'type': 'Point', 'coordinates': [0, 0]}                  2
{'type': 'Point', 'coordinates': [6.08333, 50.775]}       1
{'type': 'Point', 'coordinates': [30.35, 31.31667]}       1
{'type': 'Point', 'coordinates': [33.5, -11.5]}           1
                                                         ..
{'type': 'Point', 'coordinates': [11, 60.66667]}          1
{'type': 'Point', 'coordinates': [-79.61667, 43.2]}       1
{'type': 'Point', 'coordinates': [45.38333, 43.66667]}    1
{'type': 'Point', 'coordinates': [18.71667, 49.26667]}    1
{'type': 'Point', 'coordinates': [34.76667, 47.85]}       1
Name: geolocation, Length: 986, dtype: int64

In [62]:
# parse dictionary to get coordinates as list

df["geolocation"] = df["geolocation"].apply(lambda x: x["coordinates"] if isinstance(x, dict) else x)

In [63]:
df["year"].unique() # to check nan values

array(['1880-01-01T00:00:00.000', '1951-01-01T00:00:00.000',
       '1952-01-01T00:00:00.000', '1976-01-01T00:00:00.000',
       '1902-01-01T00:00:00.000', '1919-01-01T00:00:00.000',
       '1949-01-01T00:00:00.000', '1814-01-01T00:00:00.000',
       '1930-01-01T00:00:00.000', '1920-01-01T00:00:00.000',
       '1974-01-01T00:00:00.000', '1925-01-01T00:00:00.000',
       '1769-01-01T00:00:00.000', '1838-01-01T00:00:00.000',
       '1959-01-01T00:00:00.000', '1981-01-01T00:00:00.000',
       '1957-01-01T00:00:00.000', '2001-01-01T00:00:00.000',
       '1806-01-01T00:00:00.000', '1766-01-01T00:00:00.000',
       '2002-01-01T00:00:00.000', '1835-01-01T00:00:00.000',
       '1873-01-01T00:00:00.000', '1860-01-01T00:00:00.000',
       '1900-01-01T00:00:00.000', '1883-01-01T00:00:00.000',
       '1899-01-01T00:00:00.000', '1969-01-01T00:00:00.000',
       '2008-01-01T00:00:00.000', '1977-01-01T00:00:00.000',
       '1895-01-01T00:00:00.000', '1898-01-01T00:00:00.000',
       '1939-01-01T00:00:00.000', nan, '1822-01-01T00:00:00.000',
       '1869-01-01T00:00:00.000', '1942-01-01T00:00:00.000',
       '1971-01-01T00:00:00.000', '1984-01-01T00:00:00.000',
       '1914-01-01T00:00:00.000', '1803-01-01T00:00:00.000',
       '1954-01-01T00:00:00.000', '1932-01-01T00:00:00.000',
       '1950-01-01T00:00:00.000', '1805-01-01T00:00:00.000',
       '2009-01-01T00:00:00.000', '1923-01-01T00:00:00.000',
       '1886-01-01T00:00:00.000', '1896-01-01T00:00:00.000',
       '1933-01-01T00:00:00.000', '1945-01-01T00:00:00.000',
       '1836-01-01T00:00:00.000', '1865-01-01T00:00:00.000',
       '1842-01-01T00:00:00.000', '1858-01-01T00:00:00.000',
       '1908-01-01T00:00:00.000', '1855-01-01T00:00:00.000',
       '1968-01-01T00:00:00.000', '1938-01-01T00:00:00.000',
       '1934-01-01T00:00:00.000', '1929-01-01T00:00:00.000',
       '1922-01-01T00:00:00.000', '1907-01-01T00:00:00.000',
       '1993-01-01T00:00:00.000', '1871-01-01T00:00:00.000',
       '1892-01-01T00:00:00.000', '1913-01-01T00:00:00.000',
       '1790-01-01T00:00:00.000', '1704-01-01T00:00:00.000',
       '1904-01-01T00:00:00.000', '1910-01-01T00:00:00.000',
       '1965-01-01T00:00:00.000', '2006-01-01T00:00:00.000',
       '1994-01-01T00:00:00.000', '2012-01-01T00:00:00.000',
       '1989-01-01T00:00:00.000', '1916-01-01T00:00:00.000',
       '1893-01-01T00:00:00.000', '1961-01-01T00:00:00.000',
       '1937-01-01T00:00:00.000', '1798-01-01T00:00:00.000',
       '2004-01-01T00:00:00.000', '1943-01-01T00:00:00.000',
       '1924-01-01T00:00:00.000', '1811-01-01T00:00:00.000',
       '1859-01-01T00:00:00.000', '1921-01-01T00:00:00.000',
       '1877-01-01T00:00:00.000', '1940-01-01T00:00:00.000',
       '1905-01-01T00:00:00.000', '1827-01-01T00:00:00.000',
       '1887-01-01T00:00:00.000', '1999-01-01T00:00:00.000',
       '1843-01-01T00:00:00.000', '1796-01-01T00:00:00.000',
       '1941-01-01T00:00:00.000', '1906-01-01T00:00:00.000',
       '1909-01-01T00:00:00.000', '1833-01-01T00:00:00.000',
       '1804-01-01T00:00:00.000', '1962-01-01T00:00:00.000',
       '1808-01-01T00:00:00.000', '1894-01-01T00:00:00.000',
       '1852-01-01T00:00:00.000', '1812-01-01T00:00:00.000',
       '1823-01-01T00:00:00.000', '2003-01-01T00:00:00.000',
       '2011-01-01T00:00:00.000', '1847-01-01T00:00:00.000',
       '1956-01-01T00:00:00.000', '1960-01-01T00:00:00.000',
       '1964-01-01T00:00:00.000', '2007-01-01T00:00:00.000',
       '1990-01-01T00:00:00.000', '1946-01-01T00:00:00.000',
       '1863-01-01T00:00:00.000', '1861-01-01T00:00:00.000',
       '1870-01-01T00:00:00.000', '1991-01-01T00:00:00.000',
       '1866-01-01T00:00:00.000', '1973-01-01T00:00:00.000',
       '1846-01-01T00:00:00.000', '1874-01-01T00:00:00.000',
       '1791-01-01T00:00:00.000', '1848-01-01T00:00:00.000',
       '1583-01-01T00:00:00.000', '1810-01-01T00:00:00.000',
       '1988-01-01T00:00:00.000', '1840-01-01T00:00:00.000',
       '1998-01-01T00:00:00.000', '1885-01-01T00:00:00.000',
       '1834-01-01T00:00:00.000', '1815-01-01T00:00:00.000',
       '1841-01-01T00:00:00.000', '2013-01-01T00:00:00.000',
       '1901-01-01T00:00:00.000', '1966-01-01T00:00:00.000',
       '1978-01-01T00:00:00.000', '1979-01-01T00:00:00.000',
       '1917-01-01T00:00:00.000', '1890-01-01T00:00:00.000',
       '1844-01-01T00:00:00.000', '1936-01-01T00:00:00.000',
       '1878-01-01T00:00:00.000', '1868-01-01T00:00:00.000',
       '1829-01-01T00:00:00.000', '1897-01-01T00:00:00.000',
       '1911-01-01T00:00:00.000', '1967-01-01T00:00:00.000',
       '1884-01-01T00:00:00.000', '1903-01-01T00:00:00.000',
       '1864-01-01T00:00:00.000', '1995-01-01T00:00:00.000',
       '1970-01-01T00:00:00.000', '1853-01-01T00:00:00.000',
       '1872-01-01T00:00:00.000', '1947-01-01T00:00:00.000',
       '1785-01-01T00:00:00.000', '1400-01-01T00:00:00.000',
       '1492-01-01T00:00:00.000', '1889-01-01T00:00:00.000',
       '1837-01-01T00:00:00.000', '1879-01-01T00:00:00.000',
       '1875-01-01T00:00:00.000', '1996-01-01T00:00:00.000',
       '1944-01-01T00:00:00.000', '1882-01-01T00:00:00.000',
       '1654-01-01T00:00:00.000', '1826-01-01T00:00:00.000',
       '2000-01-01T00:00:00.000', '1918-01-01T00:00:00.000',
       '1881-01-01T00:00:00.000', '1983-01-01T00:00:00.000',
       '1980-01-01T00:00:00.000', '1891-01-01T00:00:00.000',
       '1972-01-01T00:00:00.000', '1982-01-01T00:00:00.000',
       '1851-01-01T00:00:00.000', '1817-01-01T00:00:00.000',
       '1628-01-01T00:00:00.000', '1857-01-01T00:00:00.000',
       '1912-01-01T00:00:00.000', '1825-01-01T00:00:00.000',
       '1963-01-01T00:00:00.000', '1751-01-01T00:00:00.000',
       '2010-01-01T00:00:00.000', '1975-01-01T00:00:00.000',
       '1928-01-01T00:00:00.000', '1926-01-01T00:00:00.000',
       '1621-01-01T00:00:00.000', '1819-01-01T00:00:00.000',
       '1997-01-01T00:00:00.000', '1876-01-01T00:00:00.000',
       '1821-01-01T00:00:00.000', '1955-01-01T00:00:00.000',
       '1850-01-01T00:00:00.000', '1787-01-01T00:00:00.000',
       '1867-01-01T00:00:00.000', '1809-01-01T00:00:00.000',
       '1986-01-01T00:00:00.000', '1931-01-01T00:00:00.000',
       '1985-01-01T00:00:00.000', '1987-01-01T00:00:00.000',
       '1830-01-01T00:00:00.000', '1845-01-01T00:00:00.000',
       '1813-01-01T00:00:00.000', '1854-01-01T00:00:00.000',
       '1839-01-01T00:00:00.000', '1820-01-01T00:00:00.000',
       '1935-01-01T00:00:00.000', '1768-01-01T00:00:00.000',
       '1753-01-01T00:00:00.000', '1927-01-01T00:00:00.000',
       '1948-01-01T00:00:00.000', '1801-01-01T00:00:00.000',
       '1992-01-01T00:00:00.000', '1953-01-01T00:00:00.000',
       '1915-01-01T00:00:00.000', '1862-01-01T00:00:00.000',
       '1632-01-01T00:00:00.000', '1849-01-01T00:00:00.000',
       '1637-01-01T00:00:00.000', '1795-01-01T00:00:00.000',
       '0921-01-01T00:00:00.000', '1750-01-01T00:00:00.000',
       '0861-01-01T00:00:00.000', '1662-01-01T00:00:00.000',
       '1741-01-01T00:00:00.000', '1958-01-01T00:00:00.000',
       '1520-01-01T00:00:00.000', '1671-01-01T00:00:00.000',
       '1856-01-01T00:00:00.000', '1775-01-01T00:00:00.000',
       '1779-01-01T00:00:00.000', '1723-01-01T00:00:00.000',
       '1740-01-01T00:00:00.000', '1824-01-01T00:00:00.000',
       '1828-01-01T00:00:00.000', '1491-01-01T00:00:00.000',
       '1636-01-01T00:00:00.000', '1688-01-01T00:00:00.000',
       '1715-01-01T00:00:00.000', '1773-01-01T00:00:00.000',
       '1818-01-01T00:00:00.000', '1794-01-01T00:00:00.000',
       '1647-01-01T00:00:00.000', '1623-01-01T00:00:00.000',
       '1807-01-01T00:00:00.000'], dtype=object)

In [64]:
# to split the string before T

df["year"] = df["year"].apply(lambda x: x.split("T")[0] if isinstance(x, str) else x)

In [65]:
df["year"].unique() # to check nan values

array(['1880-01-01', '1951-01-01', '1952-01-01', '1976-01-01',
       '1902-01-01', '1919-01-01', '1949-01-01', '1814-01-01',
       '1930-01-01', '1920-01-01', '1974-01-01', '1925-01-01',
       '1769-01-01', '1838-01-01', '1959-01-01', '1981-01-01',
       '1957-01-01', '2001-01-01', '1806-01-01', '1766-01-01',
       '2002-01-01', '1835-01-01', '1873-01-01', '1860-01-01',
       '1900-01-01', '1883-01-01', '1899-01-01', '1969-01-01',
       '2008-01-01', '1977-01-01', '1895-01-01', '1898-01-01',
       '1939-01-01', nan, '1822-01-01', '1869-01-01', '1942-01-01',
       '1971-01-01', '1984-01-01', '1914-01-01', '1803-01-01',
       '1954-01-01', '1932-01-01', '1950-01-01', '1805-01-01',
       '2009-01-01', '1923-01-01', '1886-01-01', '1896-01-01',
       '1933-01-01', '1945-01-01', '1836-01-01', '1865-01-01',
       '1842-01-01', '1858-01-01', '1908-01-01', '1855-01-01',
       '1968-01-01', '1938-01-01', '1934-01-01', '1929-01-01',
       '1922-01-01', '1907-01-01', '1993-01-01', '1871-01-01',
       '1892-01-01', '1913-01-01', '1790-01-01', '1704-01-01',
       '1904-01-01', '1910-01-01', '1965-01-01', '2006-01-01',
       '1994-01-01', '2012-01-01', '1989-01-01', '1916-01-01',
       '1893-01-01', '1961-01-01', '1937-01-01', '1798-01-01',
       '2004-01-01', '1943-01-01', '1924-01-01', '1811-01-01',
       '1859-01-01', '1921-01-01', '1877-01-01', '1940-01-01',
       '1905-01-01', '1827-01-01', '1887-01-01', '1999-01-01',
       '1843-01-01', '1796-01-01', '1941-01-01', '1906-01-01',
       '1909-01-01', '1833-01-01', '1804-01-01', '1962-01-01',
       '1808-01-01', '1894-01-01', '1852-01-01', '1812-01-01',
       '1823-01-01', '2003-01-01', '2011-01-01', '1847-01-01',
       '1956-01-01', '1960-01-01', '1964-01-01', '2007-01-01',
       '1990-01-01', '1946-01-01', '1863-01-01', '1861-01-01',
       '1870-01-01', '1991-01-01', '1866-01-01', '1973-01-01',
       '1846-01-01', '1874-01-01', '1791-01-01', '1848-01-01',
       '1583-01-01', '1810-01-01', '1988-01-01', '1840-01-01',
       '1998-01-01', '1885-01-01', '1834-01-01', '1815-01-01',
       '1841-01-01', '2013-01-01', '1901-01-01', '1966-01-01',
       '1978-01-01', '1979-01-01', '1917-01-01', '1890-01-01',
       '1844-01-01', '1936-01-01', '1878-01-01', '1868-01-01',
       '1829-01-01', '1897-01-01', '1911-01-01', '1967-01-01',
       '1884-01-01', '1903-01-01', '1864-01-01', '1995-01-01',
       '1970-01-01', '1853-01-01', '1872-01-01', '1947-01-01',
       '1785-01-01', '1400-01-01', '1492-01-01', '1889-01-01',
       '1837-01-01', '1879-01-01', '1875-01-01', '1996-01-01',
       '1944-01-01', '1882-01-01', '1654-01-01', '1826-01-01',
       '2000-01-01', '1918-01-01', '1881-01-01', '1983-01-01',
       '1980-01-01', '1891-01-01', '1972-01-01', '1982-01-01',
       '1851-01-01', '1817-01-01', '1628-01-01', '1857-01-01',
       '1912-01-01', '1825-01-01', '1963-01-01', '1751-01-01',
       '2010-01-01', '1975-01-01', '1928-01-01', '1926-01-01',
       '1621-01-01', '1819-01-01', '1997-01-01', '1876-01-01',
       '1821-01-01', '1955-01-01', '1850-01-01', '1787-01-01',
       '1867-01-01', '1809-01-01', '1986-01-01', '1931-01-01',
       '1985-01-01', '1987-01-01', '1830-01-01', '1845-01-01',
       '1813-01-01', '1854-01-01', '1839-01-01', '1820-01-01',
       '1935-01-01', '1768-01-01', '1753-01-01', '1927-01-01',
       '1948-01-01', '1801-01-01', '1992-01-01', '1953-01-01',
       '1915-01-01', '1862-01-01', '1632-01-01', '1849-01-01',
       '1637-01-01', '1795-01-01', '0921-01-01', '1750-01-01',
       '0861-01-01', '1662-01-01', '1741-01-01', '1958-01-01',
       '1520-01-01', '1671-01-01', '1856-01-01', '1775-01-01',
       '1779-01-01', '1723-01-01', '1740-01-01', '1824-01-01',
       '1828-01-01', '1491-01-01', '1636-01-01', '1688-01-01',
       '1715-01-01', '1773-01-01', '1818-01-01', '1794-01-01',
       '1647-01-01', '1623-01-01', '1807-01-01'], dtype=object)

In [66]:
df.iloc[[174]] # the value which stops to convert it to datetime

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,geolocation,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4
174,Castrovillari,5295,Valid,Stone-uncl,15000.0,Fell,1583-01-01,39.8,16.2,"[16.2, 39.8]",NaN,NaN

In [67]:
pd.Timestamp.min # it is minimum year limit for pandas

Timestamp('1677-09-21 00:12:43.145224193')

In [68]:
df["year"] = pd.to_datetime(df["year"], errors="ignore") 

# If we use coerce it will change it to nan values. since we have some date with less than above timestamp we 
# cant change It to datetime so i used ignore.

In [69]:
df.drop([":@computed_region_cbhk_fwbd", ":@computed_region_nnqa_25f4"], axis=1, inplace=True)

# It has been dropped since there is no info regarding this and it has lot of nan values

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         1000 non-null   object
 1   id           1000 non-null   int64
 2   nametype     1000 non-null   object
 3   recclass     1000 non-null   object
 4   mass         972 non-null    float64
 5   fall         1000 non-null   object
 6   year         999 non-null    object
 7   reclat       988 non-null    float64
 8   reclong      988 non-null    float64
 9   geolocation  988 non-null    object
dtypes: float64(3), int64(1), object(6)
memory usage: 78.2+ KB

In [71]:
df.to_csv("nasa.csv")